###################################################################

# Created by write_sdc on Mon Oct 31 14:13:37 2016

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions tt_1p2v_25c -library scx3_cmos8rf_lpvt_tt_1p2v_25c
set_wire_load_mode top
set_wire_load_model -name ibm13_wl10 -library scx3_cmos8rf_lpvt_tt_1p2v_25c
set_max_fanout 10 [current_design]
set_max_area 0
set_driving_cell -lib_cell TBUFX20TS [get_ports reset_in]
set_driving_cell -lib_cell TBUFX20TS [get_ports {fpuOpCode_in[3]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {fpuOpCode_in[2]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {fpuOpCode_in[1]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {fpuOpCode_in[0]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {roundingMode_in[1]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {roundingMode_in[0]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[31]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[30]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[29]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[28]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[27]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[26]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[25]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[24]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[23]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[22]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[21]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[20]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[19]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[18]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[17]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[16]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[15]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[14]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[13]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[12]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[11]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[10]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[9]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[8]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[7]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[6]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[5]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[4]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[3]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[2]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[1]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandA_in[0]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[31]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[30]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[29]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[28]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[27]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[26]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[25]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[24]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[23]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[22]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[21]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[20]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[19]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[18]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[17]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[16]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[15]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[14]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[13]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[12]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[11]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[10]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[9]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[8]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[7]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[6]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[5]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[4]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[3]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[2]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[1]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {operandB_in[0]}]
create_clock [get_ports clk_in]  -period 10  -waveform {0 5}
set_clock_latency 0.5  [get_clocks clk_in]
set_clock_latency -source 0.5  [get_clocks clk_in]
set_clock_uncertainty -setup 0.5  [get_clocks clk_in]
set_clock_uncertainty -hold 0  [get_clocks clk_in]
set_clock_transition -max -rise 0.5 [get_clocks clk_in]
set_clock_transition -max -fall 0.5 [get_clocks clk_in]
set_clock_transition -min -rise 0.5 [get_clocks clk_in]
set_clock_transition -min -fall 0.5 [get_clocks clk_in]
set_input_delay -clock clk_in  -max 3.5  [get_ports reset_in]
set_input_delay -clock clk_in  -min 1  [get_ports reset_in]
set_input_delay -clock clk_in  -max 3.5  [get_ports {fpuOpCode_in[3]}]
set_input_delay -clock clk_in  -min 1  [get_ports {fpuOpCode_in[3]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {fpuOpCode_in[2]}]
set_input_delay -clock clk_in  -min 1  [get_ports {fpuOpCode_in[2]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {fpuOpCode_in[1]}]
set_input_delay -clock clk_in  -min 1  [get_ports {fpuOpCode_in[1]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {fpuOpCode_in[0]}]
set_input_delay -clock clk_in  -min 1  [get_ports {fpuOpCode_in[0]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {roundingMode_in[1]}]
set_input_delay -clock clk_in  -min 1  [get_ports {roundingMode_in[1]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {roundingMode_in[0]}]
set_input_delay -clock clk_in  -min 1  [get_ports {roundingMode_in[0]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[31]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[31]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[30]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[30]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[29]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[29]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[28]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[28]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[27]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[27]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[26]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[26]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[25]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[25]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[24]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[24]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[23]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[23]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[22]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[22]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[21]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[21]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[20]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[20]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[19]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[19]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[18]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[18]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[17]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[17]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[16]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[16]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[15]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[15]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[14]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[14]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[13]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[13]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[12]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[12]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[11]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[11]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[10]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[10]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[9]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[9]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[8]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[8]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[7]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[7]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[6]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[6]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[5]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[5]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[4]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[4]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[3]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[3]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[2]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[2]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[1]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[1]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandA_in[0]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandA_in[0]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[31]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[31]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[30]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[30]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[29]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[29]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[28]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[28]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[27]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[27]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[26]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[26]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[25]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[25]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[24]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[24]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[23]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[23]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[22]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[22]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[21]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[21]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[20]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[20]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[19]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[19]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[18]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[18]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[17]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[17]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[16]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[16]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[15]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[15]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[14]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[14]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[13]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[13]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[12]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[12]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[11]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[11]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[10]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[10]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[9]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[9]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[8]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[8]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[7]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[7]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[6]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[6]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[5]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[5]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[4]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[4]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[3]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[3]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[2]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[2]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[1]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[1]}]
set_input_delay -clock clk_in  -max 3.5  [get_ports {operandB_in[0]}]
set_input_delay -clock clk_in  -min 1  [get_ports {operandB_in[0]}]
set_output_delay -clock clk_in  -max 2  [get_ports resultReady_out]
set_output_delay -clock clk_in  -min 1  [get_ports resultReady_out]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[31]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[31]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[30]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[30]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[29]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[29]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[28]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[28]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[27]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[27]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[26]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[26]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[25]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[25]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[24]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[24]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[23]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[23]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[22]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[22]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[21]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[21]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[20]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[20]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[19]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[19]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[18]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[18]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[17]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[17]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[16]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[16]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[15]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[15]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[14]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[14]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[13]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[13]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[12]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[12]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[11]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[11]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[10]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[10]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[9]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[9]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[8]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[8]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[7]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[7]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[6]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[6]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[5]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[5]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[4]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[4]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[3]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[3]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[2]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[2]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[1]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[1]}]
set_output_delay -clock clk_in  -max 2  [get_ports {result_out[0]}]
set_output_delay -clock clk_in  -min 1  [get_ports {result_out[0]}]
set_output_delay -clock clk_in  -max 2  [get_ports invalidOperation_out]
set_output_delay -clock clk_in  -min 1  [get_ports invalidOperation_out]
set_output_delay -clock clk_in  -max 2  [get_ports divisionByZero_out]
set_output_delay -clock clk_in  -min 1  [get_ports divisionByZero_out]
set_output_delay -clock clk_in  -max 2  [get_ports overflow_out]
set_output_delay -clock clk_in  -min 1  [get_ports overflow_out]
set_output_delay -clock clk_in  -max 2  [get_ports underflow_out]
set_output_delay -clock clk_in  -min 1  [get_ports underflow_out]
set_output_delay -clock clk_in  -max 2  [get_ports inexact_out]
set_output_delay -clock clk_in  -min 1  [get_ports inexact_out]
