###################################################################

# Created by write_sdc on Wed Oct 26 17:41:16 2016

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 10 [current_design]
set_max_area 0
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[53]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[52]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[51]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[50]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[49]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[48]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[47]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[46]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[45]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[44]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[43]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[42]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[41]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[40]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[39]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[38]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[37]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[36]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[35]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[34]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[33]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[32]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[31]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[30]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[29]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[28]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[27]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[26]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[25]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[24]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[23]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[22]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[21]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[20]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[19]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[18]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[17]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[16]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[15]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[14]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[13]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[12]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[11]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[10]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[9]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[8]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[7]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[6]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[5]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[4]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[3]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[2]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[1]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_A_i[0]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[53]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[52]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[51]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[50]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[49]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[48]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[47]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[46]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[45]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[44]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[43]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[42]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[41]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[40]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[39]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[38]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[37]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[36]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[35]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[34]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[33]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[32]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[31]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[30]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[29]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[28]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[27]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[26]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[25]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[24]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[23]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[22]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[21]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[20]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[19]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[18]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[17]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[16]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[15]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[14]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[13]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[12]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[11]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[10]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[9]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[8]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[7]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[6]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[5]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[4]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[3]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[2]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[1]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {Data_B_i[0]}]
