###################################################################

# Created by write_sdc on Sun Nov 13 09:14:51 2016

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions tt_1p2v_25c -library scx3_cmos8rf_lpvt_tt_1p2v_25c
set_wire_load_mode top
set_wire_load_model -name ibm13_wl10 -library scx3_cmos8rf_lpvt_tt_1p2v_25c
set_max_fanout 10 [current_design]
set_max_area 0
set_driving_cell -lib_cell TBUFX20TS [get_ports rst]
set_driving_cell -lib_cell TBUFX20TS [get_ports beg_fsm_cordic]
set_driving_cell -lib_cell TBUFX20TS [get_ports ack_cordic]
set_driving_cell -lib_cell TBUFX20TS [get_ports operation]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[63]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[62]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[61]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[60]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[59]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[58]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[57]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[56]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[55]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[54]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[53]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[52]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[51]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[50]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[49]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[48]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[47]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[46]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[45]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[44]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[43]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[42]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[41]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[40]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[39]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[38]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[37]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[36]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[35]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[34]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[33]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[32]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[31]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[30]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[29]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[28]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[27]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[26]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[25]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[24]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[23]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[22]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[21]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[20]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[19]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[18]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[17]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[16]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[15]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[14]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[13]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[12]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[11]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[10]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[9]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[8]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[7]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[6]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[5]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[4]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[3]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[2]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[1]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {data_in[0]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {shift_region_flag[1]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {shift_region_flag[0]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[63]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[62]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[61]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[60]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[59]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[58]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[57]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[56]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[55]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[54]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[53]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[52]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[51]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[50]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[49]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[48]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[47]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[46]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[45]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[44]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[43]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[42]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[41]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[40]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[39]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[38]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[37]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[36]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[35]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[34]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[33]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[32]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[31]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[30]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[29]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[28]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[27]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[26]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[25]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[24]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[23]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[22]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[21]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[20]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[19]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[18]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[17]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[16]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[15]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[14]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[13]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[12]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[11]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[10]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[9]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[8]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[7]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[6]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[5]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[4]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[3]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[2]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[1]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports {result_add_subt[0]}]
set_driving_cell -lib_cell TBUFX20TS [get_ports ready_add_subt]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency 0.5  [get_clocks clk]
set_clock_latency -source 0.5  [get_clocks clk]
set_clock_uncertainty -setup 0.5  [get_clocks clk]
set_clock_uncertainty -hold 0  [get_clocks clk]
set_clock_transition -min -fall 0.5 [get_clocks clk]
set_clock_transition -min -rise 0.5 [get_clocks clk]
set_clock_transition -max -fall 0.5 [get_clocks clk]
set_clock_transition -max -rise 0.5 [get_clocks clk]
set_input_delay -clock clk  -max 3.5  [get_ports rst]
set_input_delay -clock clk  -min 1  [get_ports rst]
set_input_delay -clock clk  -max 3.5  [get_ports beg_fsm_cordic]
set_input_delay -clock clk  -min 1  [get_ports beg_fsm_cordic]
set_input_delay -clock clk  -max 3.5  [get_ports ack_cordic]
set_input_delay -clock clk  -min 1  [get_ports ack_cordic]
set_input_delay -clock clk  -max 3.5  [get_ports operation]
set_input_delay -clock clk  -min 1  [get_ports operation]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[63]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[63]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[62]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[62]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[61]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[61]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[60]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[60]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[59]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[59]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[58]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[58]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[57]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[57]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[56]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[56]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[55]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[55]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[54]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[54]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[53]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[53]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[52]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[52]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[51]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[51]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[50]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[50]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[49]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[49]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[48]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[48]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[47]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[47]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[46]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[46]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[45]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[45]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[44]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[44]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[43]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[43]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[42]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[42]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[41]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[41]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[40]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[40]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[39]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[39]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[38]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[38]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[37]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[37]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[36]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[36]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[35]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[35]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[34]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[34]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[33]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[33]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[32]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[32]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[31]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[31]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[30]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[30]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[29]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[29]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[28]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[28]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[27]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[27]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[26]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[26]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[25]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[25]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[24]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[24]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[23]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[23]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[22]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[22]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[21]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[21]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[20]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[20]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[19]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[19]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[18]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[18]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[17]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[17]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[16]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[16]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[15]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[15]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[14]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[14]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[13]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[13]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[12]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[12]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[11]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[11]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[10]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[10]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[9]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[9]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[8]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[8]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[7]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[7]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[6]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[6]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[5]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[5]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[4]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[4]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[3]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[3]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[2]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[2]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[1]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[1]}]
set_input_delay -clock clk  -max 3.5  [get_ports {data_in[0]}]
set_input_delay -clock clk  -min 1  [get_ports {data_in[0]}]
set_input_delay -clock clk  -max 3.5  [get_ports {shift_region_flag[1]}]
set_input_delay -clock clk  -min 1  [get_ports {shift_region_flag[1]}]
set_input_delay -clock clk  -max 3.5  [get_ports {shift_region_flag[0]}]
set_input_delay -clock clk  -min 1  [get_ports {shift_region_flag[0]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[63]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[63]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[62]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[62]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[61]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[61]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[60]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[60]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[59]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[59]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[58]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[58]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[57]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[57]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[56]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[56]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[55]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[55]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[54]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[54]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[53]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[53]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[52]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[52]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[51]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[51]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[50]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[50]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[49]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[49]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[48]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[48]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[47]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[47]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[46]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[46]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[45]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[45]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[44]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[44]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[43]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[43]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[42]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[42]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[41]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[41]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[40]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[40]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[39]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[39]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[38]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[38]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[37]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[37]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[36]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[36]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[35]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[35]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[34]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[34]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[33]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[33]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[32]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[32]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[31]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[31]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[30]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[30]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[29]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[29]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[28]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[28]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[27]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[27]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[26]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[26]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[25]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[25]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[24]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[24]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[23]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[23]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[22]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[22]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[21]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[21]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[20]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[20]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[19]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[19]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[18]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[18]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[17]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[17]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[16]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[16]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[15]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[15]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[14]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[14]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[13]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[13]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[12]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[12]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[11]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[11]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[10]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[10]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[9]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[9]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[8]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[8]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[7]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[7]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[6]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[6]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[5]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[5]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[4]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[4]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[3]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[3]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[2]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[2]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[1]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[1]}]
set_input_delay -clock clk  -max 3.5  [get_ports {result_add_subt[0]}]
set_input_delay -clock clk  -min 1  [get_ports {result_add_subt[0]}]
set_input_delay -clock clk  -max 3.5  [get_ports ready_add_subt]
set_input_delay -clock clk  -min 1  [get_ports ready_add_subt]
set_output_delay -clock clk  -max 2  [get_ports ready_cordic]
set_output_delay -clock clk  -min 1  [get_ports ready_cordic]
set_output_delay -clock clk  -max 2  [get_ports {data_output[63]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[63]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[62]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[62]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[61]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[61]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[60]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[60]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[59]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[59]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[58]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[58]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[57]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[57]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[56]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[56]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[55]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[55]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[54]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[54]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[53]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[53]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[52]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[52]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[51]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[51]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[50]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[50]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[49]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[49]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[48]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[48]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[47]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[47]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[46]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[46]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[45]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[45]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[44]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[44]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[43]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[43]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[42]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[42]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[41]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[41]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[40]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[40]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[39]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[39]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[38]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[38]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[37]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[37]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[36]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[36]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[35]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[35]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[34]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[34]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[33]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[33]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[32]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[32]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[31]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[31]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[30]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[30]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[29]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[29]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[28]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[28]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[27]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[27]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[26]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[26]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[25]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[25]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[24]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[24]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[23]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[23]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[22]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[22]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[21]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[21]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[20]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[20]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[19]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[19]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[18]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[18]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[17]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[17]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[16]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[16]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[15]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[15]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[14]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[14]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[13]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[13]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[12]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[12]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[11]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[11]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[10]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[10]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[9]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[9]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[8]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[8]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[7]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[7]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[6]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[6]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[5]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[5]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[4]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[4]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[3]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[3]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[2]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[2]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[1]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[1]}]
set_output_delay -clock clk  -max 2  [get_ports {data_output[0]}]
set_output_delay -clock clk  -min 1  [get_ports {data_output[0]}]
set_output_delay -clock clk  -max 2  [get_ports beg_add_subt]
set_output_delay -clock clk  -min 1  [get_ports beg_add_subt]
set_output_delay -clock clk  -max 2  [get_ports ack_add_subt]
set_output_delay -clock clk  -min 1  [get_ports ack_add_subt]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[63]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[63]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[62]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[62]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[61]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[61]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[60]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[60]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[59]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[59]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[58]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[58]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[57]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[57]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[56]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[56]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[55]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[55]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[54]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[54]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[53]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[53]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[52]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[52]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[51]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[51]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[50]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[50]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[49]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[49]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[48]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[48]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[47]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[47]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[46]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[46]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[45]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[45]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[44]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[44]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[43]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[43]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[42]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[42]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[41]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[41]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[40]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[40]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[39]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[39]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[38]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[38]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[37]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[37]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[36]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[36]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[35]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[35]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[34]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[34]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[33]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[33]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[32]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[32]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[31]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[31]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[30]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[30]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[29]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[29]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[28]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[28]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[27]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[27]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[26]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[26]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[25]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[25]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[24]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[24]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[23]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[23]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[22]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[22]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[21]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[21]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[20]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[20]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[19]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[19]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[18]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[18]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[17]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[17]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[16]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[16]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[15]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[15]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[14]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[14]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[13]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[13]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[12]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[12]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[11]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[11]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[10]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[10]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[9]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[9]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[8]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[8]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[7]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[7]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[6]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[6]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[5]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[5]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[4]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[4]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[3]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[3]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[2]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[2]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[1]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[1]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataA[0]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataA[0]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[63]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[63]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[62]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[62]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[61]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[61]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[60]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[60]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[59]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[59]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[58]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[58]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[57]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[57]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[56]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[56]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[55]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[55]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[54]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[54]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[53]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[53]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[52]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[52]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[51]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[51]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[50]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[50]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[49]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[49]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[48]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[48]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[47]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[47]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[46]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[46]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[45]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[45]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[44]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[44]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[43]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[43]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[42]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[42]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[41]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[41]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[40]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[40]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[39]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[39]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[38]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[38]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[37]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[37]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[36]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[36]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[35]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[35]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[34]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[34]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[33]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[33]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[32]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[32]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[31]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[31]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[30]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[30]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[29]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[29]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[28]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[28]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[27]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[27]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[26]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[26]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[25]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[25]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[24]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[24]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[23]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[23]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[22]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[22]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[21]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[21]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[20]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[20]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[19]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[19]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[18]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[18]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[17]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[17]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[16]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[16]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[15]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[15]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[14]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[14]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[13]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[13]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[12]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[12]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[11]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[11]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[10]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[10]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[9]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[9]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[8]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[8]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[7]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[7]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[6]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[6]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[5]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[5]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[4]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[4]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[3]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[3]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[2]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[2]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[1]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[1]}]
set_output_delay -clock clk  -max 2  [get_ports {add_subt_dataB[0]}]
set_output_delay -clock clk  -min 1  [get_ports {add_subt_dataB[0]}]
set_output_delay -clock clk  -max 2  [get_ports op_add_subt]
set_output_delay -clock clk  -min 1  [get_ports op_add_subt]
